/*
Рівень А). Сформувати масив структур, що містять інформацію про: прізвище
студента, курс, спеціальність (для представлення спеціальності використовувати
переліки, а для представлення курсу – цілі числа) та оцінки з фізики,
математики, інформатики.
*/

/*
Рівень А) – сім клітинок: (1) – порядковий номер студента у групі, (2) –
прізвище, (3) – курс, (4) – спеціальність, оцінки з (5) – фізики, (6) –
математики, (7) – інформатики;
*/

/*
Варіант 14.
1. Програма має дати користувачеві можливість фізично впорядкувати масив в першу
чергу – за значенням оцінки з третього – профільного – предмету, в другу чергу
(для однакових оцінок з третього предмету) – за номером курсу, в останню чергу
(для однакових оцінок з третього предмету і курсів) – за прізвищем за спаданням
– в зворотному до алфавітного порядку.
2. Програма має будувати індексний масив, який забезпечує таке індексне
впорядкування: в першу чергу – за значенням оцінки з третього – профільного –
предмету, в другу чергу (для однакових оцінок з третього предмету) – за номером
курсу, в останню чергу (для однакових оцінок з третього предмету і курсів) – за
прізвищем.
3. За допомогою бінарного пошуку визначити, чи навчається студент із вказаним
користувачем прізвищем на вказаному курсі та вказаною оцінкою з третього
предмету.
*/

#include "lab102astud.h"
#include <iostream>
using namespace std;

int main() {
  vector<Student> s = {
      {1, "Lunga", 1, CS, 5, 5, 5},    {2, "Kuzma", 2, PI, 5, 4, 3},
      {3, "Petrenko", 3, CS, 4, 4, 4}, {4, "Sidorov", 4, TN, 3, 5, 4},
      {5, "Ivanov", 5, INF, 4, 3, 5},  {6, "Smirnov", 2, CS, 5, 5, 5},
      {7, "Kovalenko", 3, ME, 3, 4, 3}};

  cout << "\nПочаткові дані:\n";
  printTable(s);

  sortPhysical(s);
  cout << "\nПісля фізичного сортування:\n";
  printTable(s);

  cout << "\nІндексний масив:\n";
  auto idx = buildIndexArray(s);
  printIndexTable(s, idx);

  cout << "\nТаблиця за індексним масивом:\n";
  printIndexTable(s, idx);

  int pos = binarySearch(s, "Petrenko", 3, 4);
  cout << "\nБінарний пошук (Petrenko, курс 3, інформатика 4): \n";

  if (pos != -1)
    cout << "знайдено на позиції " << pos << endl;
  else
    cout << "не знайдено\n";

  return 0;
}
